import 'package:flutter_tts/flutter_tts.dart';

class OfflineAIService {
  final FlutterTts _tts = FlutterTts();

  OfflineAIService() {
    _tts.setLanguage("ar-SA");
    _tts.setSpeechRate(0.45);
    _tts.setPitch(1.0);
  }

  String reply(String input) {
    input = input.toLowerCase();
    String response;

    if (input.contains("صداع")) {
      response =
          "إذا عندك صداع، جربي تشربي مي، ارتاحي شوي، وإذا استمر راجعي طبيب.";
    } 
    else if (input.contains("حرق") || input.contains("حروق")) {
      response =
          "إذا الحرق خفيف، حطيه تحت مي فاترة ولا تحطي ثلج، وإذا كان قوي راجعي طبيب.";
    } 
    else if (input.contains("حمى") || input.contains("حرارة")) {
      response =
          "الحمى ممكن تكون بسبب التهاب، إذا الحرارة عالية أو مستمرة لازم طبيب.";
    } 
    else if (input.contains("كحة") || input.contains("سعال")) {
      response =
          "الكحة ممكن تكون من برد، اشربي سوائل دافئة وإذا استمرت راجعي طبيب.";
    }
    else if (input.contains("معدة") || input.contains("بطن")) {
      response =
          "ألم المعدة ممكن يكون من الأكل، جربي أكل خفيف وإذا استمر راجعي طبيب.";
    } 
    else if (input.contains("مرحبا") || input.contains("اهلا")) {
      response = "أهلًا فيك 🌸 كيف أقدر أساعدك صحيًا؟";
    } 
    else if (input.contains("اسعاف") || input.contains("طوارئ")) {
      response = "إذا في حالة طوارئ، اتصلي فورًا بالإسعاف.";
    } 
    
    else if (input.contains("استفراغ") || input.contains("غثيان")) {
      response = "إذا في غثيان أو استفراغ: ارتاحي، اشربي سوائل خفيفة بكميات قليلة، وتجنبي الأكل الثقيل";
    } 

    else if (input.contains("زكام") || input.contains("رشح")) {
      response = "الزكام يحتاج راحة وسوائل دافئة، وإذا ارتفعت الحرارة أو استمر أيام راجعي طبيب";
    } 

    else if (input.contains("تسمم") || input.contains("طوارئ")) {
      response = "في حالة التسمم: لا تجبري المصاب على الاستفراغ، واتصلي بالإسعاف فورًا";
    } 

    else if (input.contains("اسعاف") || input.contains("طوارئ")) {
      response = "إذا في حالة طوارئ، اتصلي فورًا بالإسعاف.";
    } 
      
    
    else {
      response =
          "أنا مساعد صحي بدون إنترنت، اخبرني ما الأعراض التي تشعر بها؟";
    }

    // 🔊 يخلي الذكاء الاصطناعي يحكي
    _tts.stop();
    _tts.speak(response);

    return response;
  }
}
